Revit 2027 API
ParameterTypeId.GridEndSegmentsLength Property
 "End Segments Length"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId GridEndSegmentsLength { get; }
Public Shared ReadOnly Property GridEndSegmentsLength As ForgeTypeId
	Get
public:
static property ForgeTypeId^ GridEndSegmentsLength {
	ForgeTypeId^ get ();
}
static member GridEndSegmentsLength : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace